Kinetic-analysis/nRF52832-Temperature-board/main.c
static uint16_t m_conn_handle = BLE_CONN_HANDLE_INVALID; /**< Handle of the current connection. */

// Declare a service structure for our application
ble_os_t m_our_service;

// Declare two app_timer id variables and define our timer intervals
APP_TIMER_DEF(m_our_char_timer_id);
#define OUR_CHAR_TIMER_INTERVAL APP_TIMER_TICKS(1000) //Send data to the Smartphone every 500ms
APP_TIMER_DEF(m_saadc_timer);
#define SAADC_TIMER_INTERVAL APP_TIMER_TICKS(100) // Sample the ADC every 450ms

// Use UUIDs for service(s) used in your application.
static ble_uuid_t m_adv_uuids[] = /**< Universally unique service identifiers. */
    {
        {BLE_UUID_OUR_SERVICE_UUID, BLE_UUID_TYPE_VENDOR_BEGIN}};

static void advertising_start(bool erase_bonds);

/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num   Line number of the failing ASSERT call.
 * @param[in] file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t *p_file_name) {
  app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

/**@brief Callback function for SAADC
 */
void saadc_callback(nrf_drv_saadc_evt_t const *p_event) {
  ret_code_t err_code;
  if (p_event->type == NRF_DRV_SAADC_EVT_DONE) {

    if ((m_adc_evt_counter % SAADC_CALIBRATION_INTERVAL) == 0) //Evaluate if offset calibration should be performed. Configure the SAADC_CALIBRATION_INTERVAL constant to change the calibration frequency
    {
      nrf_drv_saadc_abort();    // Abort all ongoing conversions. Calibration cannot be run if SAADC is busy
      m_saadc_calibrate = true; // Set flag to trigger calibration in main context when SAADC is stopped
    }

    if (m_saadc_calibrate == false) {
      err_code = nrf_drv_saadc_buffer_convert(p_event->data.done.p_buffer, SAMPLES_IN_BUFFER);
      APP_ERROR_CHECK(err_code);
      raw_val = p_event->data.done.p_buffer[0]; // Set the raw value from the saadc buffer
    }
    m_adc_evt_counter++;
  } else if (p_event->type == NRF_DRV_SAADC_EVT_CALIBRATEDONE) {

    err_code = nrf_drv_saadc_buffer_convert(m_buffer, SAMPLES_IN_BUFFER); //Set buffer so the SAADC can write to it again.
    APP_ERROR_CHECK(err_code);
  }
}

// Timer event handler
static void timer_timeout_handler(void *p_context) {

  voltage = raw_val / 1137.77777778f; // 12 bit resolution and 3.6V internal reference for the ADC
  resistance = voltage / (1.65f * pow(10, -6)); // We apply a constant 1.65 micro ampere to the sensor

  NRF_LOG_INFO("Raw value: %d\r\n", raw_val);
  NRF_LOG_INFO("Voltage: " NRF_LOG_FLOAT_MARKER "\r\n", NRF_LOG_FLOAT(voltage));
  NRF_LOG_INFO("Resistance: %d\r\n", resistance);

  our_resistance_characteristic_update(&m_our_service, &resistance); // send the data though BLE
}

// SAADC timer timeout handler
static void saadc_timeout_handler(void *p_context) {
  nrf_drv_saadc_sample();
}

/**@brief Function for handling Peer Manager events.
 *
 * @param[in] p_evt  Peer Manager event.
 */
static void pm_evt_handler(pm_evt_t const *p_evt) {
  ret_code_t err_code;

  switch (p_evt->evt_id) {
  case PM_EVT_BONDED_PEER_CONNECTED: {
    NRF_LOG_INFO("Connected to a previously bonded device.");
  } break;

  case PM_EVT_CONN_SEC_SUCCEEDED: {
    NRF_LOG_INFO("Connection secured: role: %d, conn_handle: 0x%x, procedure: %d.",
        ble_conn_state_role(p_evt->conn_handle),
        p_evt->conn_handle,
        p_evt->params.conn_sec_succeeded.procedure);
  } break;

  case PM_EVT_CONN_SEC_FAILED: {
    /* Often, when securing fails, it shouldn't be restarted, for security reasons.
             * Other times, it can be restarted directly.
             * Sometimes it can be restarted, but only after changing some Security Parameters.
             * Sometimes, it cannot be restarted until the link is disconnected and reconnected.
             * Sometimes it is impossible, to secure the link, or the peer device does not support it.
             * How to handle this error is highly application dependent. */
  } break;

  case PM_EVT_CONN_SEC_CONFIG_REQ: {
    // Reject pairing request from an already bonded peer.
    pm_conn_sec_config_t conn_sec_config = {.allow_repairing = false};
    pm_conn_sec_config_reply(p_evt->conn_handle, &conn_sec_config);
  } break;

  case PM_EVT_STORAGE_FULL: {
    // Run garbage collection on the flash.
    err_code = fds_gc();
    if (err_code == FDS_ERR_NO_SPACE_IN_QUEUES) {
      // Retry.
    } else {
      APP_ERROR_CHECK(err_code);
    }
  } break;

  case PM_EVT_PEERS_DELETE_SUCCEEDED: {
    advertising_start(false);
  } break;

  case PM_EVT_PEER_DATA_UPDATE_FAILED: {
    // Assert.
    APP_ERROR_CHECK(p_evt->params.peer_data_update_failed.error);
  } break;

  case PM_EVT_PEER_DELETE_FAILED: {
    // Assert.
    APP_ERROR_CHECK(p_evt->params.peer_delete_failed.error);
  } break;

  case PM_EVT_PEERS_DELETE_FAILED: {
    // Assert.
    APP_ERROR_CHECK(p_evt->params.peers_delete_failed_evt.error);
  } break;

  case PM_EVT_ERROR_UNEXPECTED: {
    // Assert.
    APP_ERROR_CHECK(p_evt->params.error_unexpected.error);
  } break;

  case PM_EVT_CONN_SEC_START:
  case PM_EVT_PEER_DATA_UPDATE_SUCCEEDED:
  case PM_EVT_PEER_DELETE_SUCCEEDED:
  case PM_EVT_LOCAL_DB_CACHE_APPLIED:
  case PM_EVT_LOCAL_DB_CACHE_APPLY_FAILED:
    // This can happen when the local DB has changed.
  case PM_EVT_SERVICE_CHANGED_IND_SENT:
  case PM_EVT_SERVICE_CHANGED_IND_CONFIRMED:
  default:
    break;
  }
}

/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
static void timers_init(void) {
  // Initialize timer module.
  ret_code_t err_code = app_timer_init();
  APP_ERROR_CHECK(err_code);

  // Initiate our timers
  app_timer_create(&m_our_char_timer_id, APP_TIMER_MODE_REPEATED, timer_timeout_handler);
  app_timer_create(&m_saadc_timer, APP_TIMER_MODE_REPEATED, saadc_timeout_handler);
}

